org-posts/posts.org
#+hugo_base_dir: ../
#+hugo_section: post
#+property: header-args :eval no

*** DONE GitHub
    CLOSED: [2019-09-23 lun 12:37]
    :PROPERTIES:
    :EXPORT_FILE_NAME: uso-github
    :END:

En este artículo se explicará el uso de la herramienta *GitHub* y las posibilidades que ofrece en el entorno educativo.
#+hugo: more

**** Videotutoriales
  - [[https://youtu.be/SJf4iTkMNPo][Sesión 3.1]]
  - [[https://youtu.be/GMH6hN8FKSU][Sesión 3.2]]
  - [[https://youtu.be/5EJjRqtpqOM][Sesión 3.3]]
  - [[https://youtu.be/A5PKw10PmNU][Sesión 3.4]]

**** Índice
      - Breve descripción y posibilidades en la gestión de tareas del alumnado
      - Alternativas: GitLab, BitBucket,...
      - Cuentas
      - Configuración de la cuenta
      - Manejo básico de la plataforma
      - Repositorios: manejo y ajustes
      - Red social: comentarios, seguidores, etc.
      - Issues y Proyectos
      - Colaboración: Forks y Pull Requests
      - Organizaciones

**** Referencias
  - [[https://help.github.com/][Ayuda de GitHub]]
  - [[https://help.github.com/articles/basic-writing-and-formatting-syntax/][Sintaxis de MarkDown]]
  - [[https://help.github.com/articles/permission-levels-for-a-user-account-repository/#collaborator-access-on-a-repository-owned-by-a-user-account][Permisos de los colaboradores en un repositorio]]
  - [[https://education.github.com/pack][Solicitud de pack de estudiante]]
  - [[https://help.github.com/articles/closing-issues-using-keywords/][Cerrar issues a través de mensajes en el commit]]

**** Contenidos
  - [[https://pedroprieto.github.io/curso-github/presentaciones/sesion-3-presentacion.html][Presentación]]
