content/post/uso-github.md
+++
title = "GitHub"
date = 2019-09-23T12:37:00+02:00
categories = ["diw", "diw-herramientas"]
draft = false
+++

En este artículo se explicará el uso de la herramienta **GitHub** y las posibilidades que ofrece en el entorno educativo.

<!--more-->


## Videotutoriales {#videotutoriales}

-   [Sesión 3.1](https://youtu.be/SJf4iTkMNPo)
-   [Sesión 3.2](https://youtu.be/GMH6hN8FKSU)
-   [Sesión 3.3](https://youtu.be/5EJjRqtpqOM)
-   [Sesión 3.4](https://youtu.be/A5PKw10PmNU)


## Índice {#índice}

-   Breve descripción y posibilidades en la gestión de tareas del alumnado
-   Alternativas: GitLab, BitBucket,...
-   Cuentas
-   Configuración de la cuenta
-   Manejo básico de la plataforma
-   Repositorios: manejo y ajustes
-   Red social: comentarios, seguidores, etc.
-   Issues y Proyectos
-   Colaboración: Forks y Pull Requests
-   Organizaciones


## Referencias {#referencias}

-   [Ayuda de GitHub](https://help.github.com/)
-   [Sintaxis de MarkDown](https://help.github.com/articles/basic-writing-and-formatting-syntax/)
-   [Permisos de los colaboradores en un repositorio](https://help.github.com/articles/permission-levels-for-a-user-account-repository/#collaborator-access-on-a-repository-owned-by-a-user-account)
-   [Solicitud de pack de estudiante](https://education.github.com/pack)
-   [Cerrar issues a través de mensajes en el commit](https://help.github.com/articles/closing-issues-using-keywords/)


## Contenidos {#contenidos}

-   [Presentación](https://pedroprieto.github.io/curso-github/presentaciones/sesion-3-presentacion.html)
